In [1]:
# Import libraries
import pandas as pd
import sqlite3
import sql

In [2]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [3]:
# Load the SQL module to iPython
%load_ext sql

In [4]:
%sql sqlite:///jupyter_sql_tutorial.db

In [10]:
# import tables from churn clean
contract = pd.read_csv('data/contract.csv')
customer = pd.read_csv('data/customer.csv')
job = pd.read_csv('data/job.csv')
location = pd.read_csv('data/location.csv')
payment = pd.read_csv('data/payment.csv')

In [14]:
# Import into SQLite database
# customer.to_sql('customer', cnn)
# location.to_sql('location', cnn)
# job.to_sql('job', cnn)
# payment.to_sql('payment', cnn)

In [5]:
%%sql
SELECT *
FROM Sheborgs

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8, 2019, 200000000, 404000000, None),
 (1, 'Cortana', 21, 'Halo', 9, 2001, None, None, None),
 (2, 'Major', 35, 'Ghost in the Shell', 10, 1989, 110000000, 169800000, None),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5, 1997, None, None, None),
 (4, 'Pris', 3.75, 'Blade Runner', 8, 1982, 30000000, 41500000, None),
 (5, 'Ada', 1, 'Ex Machina', 8, 2014, 15000000, 36900000, None),
 (6, 'Freya', 121, 'Saturns Children', 8.5, 2008, None, None, None)]

## Source table

In [6]:
%%sql

SELECT 
    Year, COUNT(*) AS Gynoids
FROM Sheborgs
WHERE 
    Space = NOT NULL
    AND Beauty = NOT NULL
    AND Year = NOT NULL
GROUP BY Year
ORDER BY Year ASC;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[]

In [7]:
%%sql

SELECT 
    l.name AS league,
    COUNT(m.country_id) AS matches
FROM league AS l
LEFT JOIN match AS m
ON l.country_id = m.country_id
GROUP BY l.name;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: league
[SQL: SELECT l.name AS league,
    COUNT(m.country_id) AS matches
FROM league AS l
LEFT JOIN match AS m
ON l.country_id = m.country_id
GROUP BY l.name;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### Add filters to WHERE clause

In [8]:
%%sql

SELECT 
    date,
    id,
    home_goal,
    away_goal
FROM match
WHERE season = '2013/2014'
        AND home_team_goal > away_team_goal;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: match
[SQL: SELECT date, id, home_goal,
    away_goal
FROM match
WHERE season = '2013/2014'
        AND home_team_goal > away_team_goal;]
(Background on this error at: http://sqlalche.me/e/e3q8)

## CASE statements - WHEN, THEN, ELSE . . . finished with END
#### Example:
<br>CASE WHEN x = 1 THEN 'a'
<br>&emsp; &emsp; WHEN x = 2 THEN 'b'
<br>&emsp; &emsp; ELSE 'c' END AS new_column

In [9]:
%%sql

SELECT 
    id, 
    home_goal,
    away_goal,
    CASE WHEN home_goal > away_goal THEN 'Home Team Win'
        WHEN home_goal < away_goal THEN 'Away Team Win'
        ELSE 'Tie' END AS outcome
FROM match
WHERE season = '2013/2014';

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: match
[SQL: SELECT id, home_goal, away_goal,
    CASE WHEN home_goal > away_goal THEN 'Home Team Win'
        WHEN home_goal < away_goal THEN 'Away Team Win'
        ELSE 'Tie' END AS outcome
FROM match
WHERE season = '2013/2014';]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [13]:
%%sql

SELECT *
FROM contract;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Month-to-month'), (1, 2, 'One year'), (2, 3, 'Two Year')]